app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("identification", "email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["identification", 123456], ["email", "ivan@gmail.com"], ["name", "ivan"], ["created_at", "2020-04-12 01:19:43.632401"], ["updated_at", "2020-04-12 01:19:43.632401"]]

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]